raymundo140/SmartDoorLock_STM32/1lab/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

#include "stm32h5xx_nucleo.h"
#include <stdio.h>

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define seg_10_Pin GPIO_PIN_0
#define seg_10_GPIO_Port GPIOC
#define seg_11_Pin GPIO_PIN_1
#define seg_11_GPIO_Port GPIOC
#define seg_12_Pin GPIO_PIN_3
#define seg_12_GPIO_Port GPIOC
#define buzzer_Pin GPIO_PIN_6
#define buzzer_GPIO_Port GPIOA
#define c4_Pin GPIO_PIN_7
#define c4_GPIO_Port GPIOA
#define led_o2_Pin GPIO_PIN_4
#define led_o2_GPIO_Port GPIOC
#define seg_5_Pin GPIO_PIN_5
#define seg_5_GPIO_Port GPIOC
#define seg_1_Pin GPIO_PIN_2
#define seg_1_GPIO_Port GPIOB
#define r2_Pin GPIO_PIN_10
#define r2_GPIO_Port GPIOB
#define seg_2_Pin GPIO_PIN_12
#define seg_2_GPIO_Port GPIOB
#define buzzerB13_Pin GPIO_PIN_13
#define buzzerB13_GPIO_Port GPIOB
#define c2_Pin GPIO_PIN_6
#define c2_GPIO_Port GPIOC
#define c1_Pin GPIO_PIN_7
#define c1_GPIO_Port GPIOC
#define c3_Pin GPIO_PIN_9
#define c3_GPIO_Port GPIOC
#define r1_Pin GPIO_PIN_8
#define r1_GPIO_Port GPIOA
#define seg_4_Pin GPIO_PIN_9
#define seg_4_GPIO_Port GPIOA
#define seg_6_Pin GPIO_PIN_10
#define seg_6_GPIO_Port GPIOA
#define seg_3_Pin GPIO_PIN_11
#define seg_3_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define JTDI_Pin GPIO_PIN_15
#define JTDI_GPIO_Port GPIOA
#define seg_7_Pin GPIO_PIN_10
#define seg_7_GPIO_Port GPIOC
#define seg_9_Pin GPIO_PIN_11
#define seg_9_GPIO_Port GPIOC
#define seg_8_Pin GPIO_PIN_12
#define seg_8_GPIO_Port GPIOC
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define r3_Pin GPIO_PIN_4
#define r3_GPIO_Port GPIOB
#define r4_Pin GPIO_PIN_5
#define r4_GPIO_Port GPIOB
#define led_o1_Pin GPIO_PIN_8
#define led_o1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
